УНФ_ТЕСТ/src/Catalogs/КП_ЦветаЭлементов/КП_ЦветаЭлементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_ЦветаЭлементов</name>
  <attributes>
    <name>Red</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Green</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Blue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_ЦветаЭлементов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЭтоНовый=Истина;
		
		Объект.Red=80;
		Объект.Green=160;
		Объект.Blue=80;
		
	КонецЕсли;
	
	УстановитьЗаголовок(Параметры.Ключ.Пустая());
	ОбновитьПолеЦвета();
	
КонецПроцедуры

Процедура УстановитьЗаголовок(ЭтоНовый=Ложь)
	Если ЭтоНовый ИЛИ ПустаяСтрока(Объект.Наименование) Тогда
		ЭтаФорма.Заголовок="Создайте цвет";
	Иначе
		ЭтаФорма.Заголовок=Объект.Наименование;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура RedПриИзменении(Элемент)
	Если Объект.Red>255 Тогда
		Объект.Red=255;
	КонецЕсли;
	
	ОбновитьПолеЦвета();
	
КонецПроцедуры

&НаКлиенте
Процедура GreenПриИзменении(Элемент)
	Если Объект.Green>255 Тогда
		Объект.Green=255;
	КонецЕсли;

	ОбновитьПолеЦвета();
	
КонецПроцедуры

&НаКлиенте
Процедура BlueПриИзменении(Элемент)
	
	Если Объект.Blue>255 Тогда
		Объект.Blue=255;
	КонецЕсли;

	ОбновитьПолеЦвета();
	
КонецПроцедуры

Процедура ОбновитьПолеЦвета()
	ЦветЭлемента=Новый Цвет(Объект.Red, Объект.Green, Объект.Blue);
	Элементы.ДекорацияВыбранныйЦвет.ЦветФона=ЦветЭлемента;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЭтоНовый=Ложь;
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаRedМинус(Команда)
	Объект.Red=Макс(0, Объект.Red-15);
	ОбновитьПолеЦвета();
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаRedПлюс(Команда)
	Объект.Red=Мин(255, Объект.Red+15);
	ОбновитьПолеЦвета();
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаBlueМинус(Команда)
	Объект.Blue=Макс(0, Объект.Blue-15);
	ОбновитьПолеЦвета();
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаBlueПлюс(Команда)
	Объект.Blue=Мин(255, Объект.Blue+15);
	ОбновитьПолеЦвета();
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаGreenМинус(Команда)
	Объект.Green=Макс(0, Объект.Green-15);
	ОбновитьПолеЦвета();
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаGreenПлюс(Команда)
	Объект.Green=Мин(255, Объект.Green+15);
	ОбновитьПолеЦвета();
	Модифицированность=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
	Оповестить("СозданНовыйЦвет", Объект.Ссылка);
	Оповестить("КП_ИзменениеНастройкиЦвета");
КонецПроцедуры
